emsesp/EMS-ESP32/src/core/system.cpp
    // these commands will return data in JSON format
    Command::add(EMSdevice::DeviceType::SYSTEM, F("response"), System::command_response, FL_(commands_response));

    // MQTT subscribe "ems-esp/system/#"
    Mqtt::subscribe(EMSdevice::DeviceType::SYSTEM, "system/#", nullptr); // use empty function callback
}

// uses LED to show system health
void System::led_monitor() {
    // if button is pressed, show LED (yellow on RGB LED, on/off on standard LED)
    static bool button_busy_ = false;
    if (button_busy_ != myPButton_.button_busy()) {
        button_busy_ = myPButton_.button_busy();
        if (led_type_) {
            EMSESP_RGB_WRITE(led_gpio_, button_busy_ ? RGB_LED_BRIGHTNESS : 0, button_busy_ ? RGB_LED_BRIGHTNESS : 0, 0); // Yellow
        } else {
            digitalWrite(led_gpio_, button_busy_ ? LED_ON : !LED_ON);
        }
    }

    // we only need to run the LED healthcheck if there are errors
    // skip if we're in the led_flash_timer or if a button has been pressed
    if (!healthcheck_ || !led_gpio_ || button_busy_ || led_flash_timer_) {
        return; // all good
    }

    static uint32_t led_long_timer_  = 1; // 1 will kick it off immediately
    static uint32_t led_short_timer_ = 0;
    static uint8_t  led_flash_step_  = 0; // 0 means we're not in the short flash timer

    auto current_time = uuid::get_uptime();

    // first long pause before we start flashing
    if (led_long_timer_ && (uint32_t)(current_time - led_long_timer_) >= HEALTHCHECK_LED_LONG_DUARATION) {
        led_short_timer_ = current_time; // start the short timer
        led_long_timer_  = 0;            // stop long timer
        led_flash_step_  = 1;            // enable the short flash timer
    }

    // the flash timer which starts after the long pause
    if (led_flash_step_ && (uint32_t)(current_time - led_short_timer_) >= HEALTHCHECK_LED_FLASH_DUARATION) {
        led_long_timer_     = 0; // stop the long timer
        led_short_timer_    = current_time;
        static bool led_on_ = false;

        if (++led_flash_step_ == 8) {
            // reset the whole sequence
            led_long_timer_ = uuid::get_uptime();
            led_flash_step_ = 0;
            led_type_ ? EMSESP_RGB_WRITE(led_gpio_, 0, 0, 0) : digitalWrite(led_gpio_, !LED_ON); // LED off
        } else if (led_flash_step_ % 2) {
            // handle the step events (on odd numbers 3,5,7,etc). see if we need to turn on a LED
            //  1 flash (blue) is the EMS bus is not connected
            //  2 flashes (red, red) if the network (wifi or ethernet) is not connected
            //  3 flashes (red, red, blue) is both the bus and the network are not connected
            bool no_network = (healthcheck_ & HEALTHCHECK_NO_NETWORK) == HEALTHCHECK_NO_NETWORK;
            bool no_bus     = (healthcheck_ & HEALTHCHECK_NO_BUS) == HEALTHCHECK_NO_BUS;

            if (led_type_) {
                if (led_flash_step_ == 3) {
                    if (no_network) {
                        EMSESP_RGB_WRITE(led_gpio_, RGB_LED_BRIGHTNESS, 0, 0); // red
                    } else if (no_bus) {
                        EMSESP_RGB_WRITE(led_gpio_, 0, 0, RGB_LED_BRIGHTNESS); // blue
                    }
                }
                if (led_flash_step_ == 5 && no_network) {
                    EMSESP_RGB_WRITE(led_gpio_, RGB_LED_BRIGHTNESS, 0, 0); // red
                }
                if ((led_flash_step_ == 7) && no_network && no_bus) {
                    EMSESP_RGB_WRITE(led_gpio_, 0, 0, RGB_LED_BRIGHTNESS); // blue
                }
            } else {
                if ((led_flash_step_ == 3) && (no_network || no_bus)) {
                    led_on_ = true;
                }

                if ((led_flash_step_ == 5) && no_network) {
                    led_on_ = true;
                }

                if ((led_flash_step_ == 7) && no_network && no_bus) {
                    led_on_ = true;
                }

                if (led_on_) {
                    digitalWrite(led_gpio_, LED_ON); // LED on
                }
            }
        } else {
            // turn the led off after the flash, on even number count
            if (led_on_) {
                led_type_ ? EMSESP_RGB_WRITE(led_gpio_, 0, 0, 0) : digitalWrite(led_gpio_, !LED_ON);
                led_on_ = false;
            }
        }
    }
}

// Return the quality (Received Signal Strength Indicator) of the WiFi network as a %
//  High quality: 90% ~= -55dBm
//  Medium quality: 50% ~= -75dBm
//  Low quality: 30% ~= -85dBm
//  Unusable quality: 8% ~= -96dBm
int8_t System::wifi_quality(int8_t dBm) {
    if (dBm <= -100) {
        return 0;
    }

    if (dBm >= -50) {
        return 100;
    }
    return 2 * (dBm + 100);
}

// print users to console
void System::show_users(uuid::console::Shell & shell) {
    if (!shell.has_flags(CommandFlags::ADMIN)) {
        shell.printfln("Unauthorized. You need to be an admin to view users.");
        return;
    }

    shell.printfln("Users:");

#ifndef EMSESP_STANDALONE
    EMSESP::esp32React.getSecuritySettingsService()->read([&](SecuritySettings & securitySettings) {
        for (const User & user : securitySettings.users) {
            shell.printfln(" username: %s, password: %s, is_admin: %s", user.username.c_str(), user.password.c_str(), user.admin ? ("yes") : ("no"));
        }
    });
#endif

    shell.println();
}

// shell command 'show system'
void System::show_system(uuid::console::Shell & shell) {
    refreshHeapMem(); // refresh free heap and max alloc heap

    shell.println();
    shell.println("System:");
    shell.printfln(" Version: %s", EMSESP_APP_VERSION);
#ifndef EMSESP_STANDALONE
    shell.printfln(" Platform: %s (%s)", EMSESP_PLATFORM, ESP.getChipModel());
    shell.printfln(" Model: %s", getBBQKeesGatewayDetails().c_str());
#endif
    shell.printfln(" Language: %s", locale().c_str());
    shell.printfln(" Board profile: %s", board_profile().c_str());
    shell.printfln(" Uptime: %s", uuid::log::format_timestamp_ms(uuid::get_uptime_ms(), 3).c_str());
#ifndef EMSESP_STANDALONE
    // https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/system/misc_system_api.html
    unsigned char mac_base[6] = {0};
    esp_efuse_mac_get_default(mac_base);
    esp_read_mac(mac_base, ESP_MAC_WIFI_STA);
    shell.printfln(" Base MAC Address: %02X:%02X:%02X:%02X:%02X:%02X", mac_base[0], mac_base[1], mac_base[2], mac_base[3], mac_base[4], mac_base[5]);

    shell.printfln(" SDK version: %s", ESP.getSdkVersion());
    shell.printfln(" CPU frequency: %lu MHz", ESP.getCpuFreqMHz());
#if CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32S2
    shell.printfln(" CPU temperature: %d °C", (int)temperature());
#endif
    shell.printfln(" Free heap/Max alloc: %lu KB / %lu KB", getHeapMem(), getMaxAllocMem());
    shell.printfln(" App used/free: %lu KB / %lu KB", appUsed(), appFree());
    uint32_t FSused = LittleFS.usedBytes() / 1024;
    shell.printfln(" FS used/free: %lu KB / %lu KB", FSused, FStotal() - FSused);
    shell.printfln(" Flash size: %lu KB", ESP.getFlashChipSize() / 1024);
    if (PSram()) {
        shell.printfln(" PSRAM size/free: %lu KB / %lu KB", PSram(), ESP.getFreePsram() / 1024);
    } else {
        shell.printfln(" PSRAM: not available");
    }
    // GPIOs
    shell.println(" GPIOs:");
    shell.printf("  allowed:");
    for (const auto & gpio : valid_system_gpios_) {
        shell.printf(" %d", gpio);
    }
    shell.printfln(" [total %d]", valid_system_gpios_.size());
    shell.printf("  in use:");
    auto sorted_gpios = used_gpios_;
    std::sort(sorted_gpios.begin(), sorted_gpios.end(), [](const GpioUsage & a, const GpioUsage & b) { return a.pin < b.pin; });
    for (const auto & gpio : sorted_gpios) {
        shell.printf(" %d(%s)", gpio.pin, gpio.source.c_str());
    }
    shell.printfln(" [total %d]", used_gpios_.size());
    auto available = available_gpios();
    shell.printf("  available:");
    for (const auto & gpio : available) {
        shell.printf(" %d", gpio);
    }
    shell.printfln(" [total %d]", available.size());
    // List all partitions and their version info
    shell.println(" Partitions:");
    for (const auto & partition : partition_info_) {
        if (partition.second.version.empty()) {
            continue; // no version, empty string
        }
        std::string installed;
        if (partition.second.install_date > 0) {
            char   time_string[25];
            time_t d = partition.second.install_date;
            strftime(time_string, sizeof(time_string), "%FT%T", localtime(&d));
            installed = std::string(", installed on ") + time_string;
        }
        shell.printfln("  %s: v%s (%d KB%s) %s",
                       partition.first.c_str(),
                       partition.second.version.c_str(),
                       partition.second.size,
                       installed.c_str(),
                       (strcmp(esp_ota_get_running_partition()->label, partition.first.c_str()) == 0) ? "** active **" : "");
    }

