emsesp/EMS-ESP32/src/core/system.cpp
    node = nodes.add<JsonObject>();
    exportSettings("schedule", EMSESP_SCHEDULER_FILE, node);
    node = nodes.add<JsonObject>();
    exportSettings("customizations", EMSESP_CUSTOMIZATION_FILE, node);
    node = nodes.add<JsonObject>();
    exportSettings("entities", EMSESP_CUSTOMENTITY_FILE, node);
    node = nodes.add<JsonObject>();
    exportSettings("modules", EMSESP_MODULES_FILE, node);

#ifndef EMSESP_STANDALONE
    // special case for custom support
    File file = LittleFS.open(EMSESP_CUSTOMSUPPORT_FILE, "r");
    if (file) {
        JsonDocument         jsonDocument;
        DeserializationError error = deserializeJson(jsonDocument, file);
        file.close(); // close early, we no longer need the file
        if (!error && jsonDocument.is<JsonObject>()) {
            JsonObject support_node = nodes.add<JsonObject>();
            support_node["type"]    = "customSupport";
            support_node["data"].set(jsonDocument.as<JsonObject>());
            LOG_DEBUG("Exported custom support file %s", EMSESP_CUSTOMSUPPORT_FILE);
        } else {
            LOG_ERROR("Failed to deserialize custom support file");
        }
    }

    // Backup NVS values
    node         = nodes.add<JsonObject>();
    node["type"] = "nvs";

    const char *   nvs_part = esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_DATA_NVS, "nvs1") ? "nvs1" : "nvs"; // nvs1 is on 16MBs
    nvs_iterator_t it       = nullptr;
#if ESP_IDF_VERSION_MAJOR < 5
    it = nvs_entry_find(nvs_part, "ems-esp", NVS_TYPE_ANY);
    if (it == nullptr) {
#else
    esp_err_t err = nvs_entry_find(nvs_part, "ems-esp", NVS_TYPE_ANY, &it);
    if (err != ESP_OK) {
#endif
        LOG_ERROR("Failed to find NVS entry for %s", nvs_part);
        return;
    }

    JsonArray entries = node["nvs"].to<JsonArray>();
#if ESP_IDF_VERSION_MAJOR < 5
    while (it != nullptr) {
        nvs_entry_info_t info;
        nvs_entry_info(it, &info);
#else
    while (err == ESP_OK) {
        nvs_entry_info_t info;
        nvs_entry_info(it, &info);
#endif
        JsonObject entry = entries.add<JsonObject>();
        entry["type"]    = info.type;
        entry["key"]     = info.key;

        LOG_DEBUG("Exporting NVS value: %s = %d", info.key, info.type);

        switch (info.type) {
        case NVS_TYPE_I8:
            entry["value"] = EMSESP::nvs_.getChar(info.key);
            break;
        case NVS_TYPE_U8:
            entry["value"] = EMSESP::nvs_.getUChar(info.key);
            break;
        case NVS_TYPE_I32:
            entry["value"] = EMSESP::nvs_.getInt(info.key);
            break;
        case NVS_TYPE_U32:
            entry["value"] = EMSESP::nvs_.getUInt(info.key);
            break;
        case NVS_TYPE_I64:
            entry["value"] = EMSESP::nvs_.getLong64(info.key);
            break;
        case NVS_TYPE_U64:
            entry["value"] = EMSESP::nvs_.getULong64(info.key);
            break;
        case NVS_TYPE_BLOB:
            entry["value"] = EMSESP::nvs_.getDouble(info.key); // bytes used for double values
            break;
        case NVS_TYPE_STR:
        case NVS_TYPE_ANY:
        default:
            entry["value"] = EMSESP::nvs_.getString(info.key);
            break;
        }

#if ESP_IDF_VERSION_MAJOR < 5
        it = nvs_entry_next(it);
    }
#else
        err = nvs_entry_next(&it);
    }
#endif

    if (it != nullptr) {
        nvs_release_iterator(it);
    }
#endif
}

// write a settings file using input from a json object, called from upload/restore
bool System::saveSettings(const char * filename, JsonObject input) {
#ifndef EMSESP_STANDALONE
    const char * section = nullptr;
    for (const auto & [f, label] : SECTION_MAP) {
        if (strcmp(f, filename) == 0) {
            section = label;
            break;
        }
    }

    if (!section) {
        return false;
    }

    JsonObject section_json = input[section];
    if (section_json) {
        File section_file = LittleFS.open(filename, "w");
        if (section_file) {
            LOG_DEBUG("Applying new uploaded %s data", section);
            serializeJson(section_json, section_file);
            section_file.close();
            return true; // reboot required
        }
    }
#endif

    return false; // not found
}

// set a entity of services 'network', 'settings', 'mqtt', etc.
bool System::command_service(const char * cmd, const char * value) {
    bool ok = false;
    bool b;
    if (Helpers::value2bool(value, b)) {
        if (!strcmp(cmd, "settings/showertimer")) {
            EMSESP::webSettingsService.update([&](WebSettings & settings) {
                settings.shower_timer = b;
                return StateUpdateResult::CHANGED;
            });
            EMSESP::shower_.shower_timer(b);
            ok = true;
        } else if (!strcmp(cmd, "settings/showeralert")) {
            EMSESP::webSettingsService.update([&](WebSettings & settings) {
                settings.shower_alert = b;
                return StateUpdateResult::CHANGED;
            });
            EMSESP::shower_.shower_alert(b);
            ok = true;
        } else if (!strcmp(cmd, "settings/hideled")) {
            EMSESP::webSettingsService.update([&](WebSettings & settings) {
                settings.hide_led = b;
                return StateUpdateResult::CHANGED;
            });
            EMSESP::system_.hide_led(b);
            ok = true;
        } else if (!strcmp(cmd, "settings/analogenabled")) {
            EMSESP::webSettingsService.update([&](WebSettings & settings) {
                settings.analog_enabled = b;
                return StateUpdateResult::CHANGED;
            });
            EMSESP::system_.analog_enabled(b);
            ok = true;
        } else if (!strcmp(cmd, "mqtt/enabled")) {
            EMSESP::esp32React.getMqttSettingsService()->update([&](MqttSettings & Settings) {
                Settings.enabled = b;
                return StateUpdateResult::CHANGED;
            });
            ok = true;
        } else if (!strcmp(cmd, "ap/enabled")) {
            EMSESP::esp32React.getAPSettingsService()->update([&](APSettings & Settings) {
                Settings.provisionMode = b ? 0 : 2;
                return StateUpdateResult::CHANGED;
            });
            ok = true;
        } else if (!strcmp(cmd, "ntp/enabled")) {
            EMSESP::esp32React.getNTPSettingsService()->update([&](NTPSettings & Settings) {
                Settings.enabled = b;
                return StateUpdateResult::CHANGED;
            });
            ok = true;
        } else if (!strcmp(cmd, "syslog/enabled")) {
            EMSESP::webSettingsService.update([&](WebSettings & settings) {
                settings.syslog_enabled = b;
                return StateUpdateResult::CHANGED;
            });
            EMSESP::system_.syslog_enabled_ = b;
            EMSESP::system_.syslog_init();
            ok = true;
        }
    }

    int n;
    if (!ok && Helpers::value2number(value, n)) {
#ifndef EMSESP_STANDALONE
        if (!strcmp(cmd, "fuse/mfg")) {
            ok = esp_efuse_write_reg(EFUSE_BLK3, 0, (uint32_t)n) == ESP_OK;
            ok ? LOG_INFO("fuse programed with value '%X': successful", n) : LOG_ERROR("fuse programed with value '%X': failed", n);
        }
        if (!strcmp(cmd, "fuse/mfgadd")) {
            uint8_t reg = 0;
            while (esp_efuse_read_reg(EFUSE_BLK3, reg) != 0 && reg < 7)
                reg++;
            ok = esp_efuse_write_reg(EFUSE_BLK3, reg, (uint32_t)n) == ESP_OK;
            ok ? LOG_INFO("fuse %d programed with value '%X': successful", reg, n) : LOG_ERROR("fuse %d programed with value '%X': failed", reg, n);
            return true;
        }
#endif
    }

    if (ok) {
        LOG_INFO("System command '%s' with value '%s'", cmd, value);
    }
    return ok;
}

// return back a system value
bool System::get_value_info(JsonObject output, const char * cmd) {
    if (cmd == nullptr || strlen(cmd) == 0) {
        LOG_ERROR("empty system command");
        return false;
    }
    if (!strcmp(cmd, "restart")) { // restart is a command, not an entity
        return false;
    }
    // check for hardcoded "info"/"value"
    if (!strcmp(cmd, F_(info)) || !strcmp(cmd, F_(values))) {
        return command_info("", 0, output);
    }

    // check for metrics
    if (!strcmp(cmd, F_(metrics))) {
        std::string metrics = get_metrics_prometheus();
        if (!metrics.empty()) {
            output["api_data"] = metrics;
            return true;
        }
        return false;
    }

    // fetch all the data from the system in a different json
    JsonDocument doc;
    JsonObject   root = doc.to<JsonObject>();
    (void)command_info("", 0, root);

