emsesp/EMS-ESP32/src/core/system.cpp
    return true;
}

// remove a gpio from both valid and used lists
void System::remove_gpio(uint8_t pin, bool also_system) {
    auto it = std::find_if(used_gpios_.begin(), used_gpios_.end(), [pin](const GpioUsage & usage) { return usage.pin == pin; });
    if (it != used_gpios_.end()) {
        LOG_DEBUG("GPIO %d removed from used gpio list", pin);
        used_gpios_.erase(it);
    }

    if (also_system) {
        auto it_sys = std::find(valid_system_gpios_.begin(), valid_system_gpios_.end(), pin);
        if (it_sys != valid_system_gpios_.end()) {
            LOG_DEBUG("GPIO %d removed from valid gpio list", pin);
            valid_system_gpios_.erase(it_sys);
        }
    }
}

// remove a gpio that has 0 for disable
void System::remove_optional_gpio(uint8_t pin) {
    if (pin) {
        remove_gpio(pin, false);
    }
}

// set unused gpios to default state input high-Z
void System::reset_unused_gpios() {
    for (const auto & pin : valid_system_gpios_) {
        auto it = std::find_if(used_gpios_.begin(), used_gpios_.end(), [pin](const GpioUsage & usage) { return usage.pin == pin; });
        if (it == used_gpios_.end()) {
            LOG_DEBUG("reset pin %d", pin);
            pinMode(pin, INPUT);
        }
    }
}

// return a list of GPIO's available for use
std::vector<uint8_t> System::available_gpios() {
    std::vector<uint8_t> gpios;
    for (const auto & gpio : valid_system_gpios_) {
        if (std::find_if(used_gpios_.begin(), used_gpios_.end(), [gpio](const GpioUsage & usage) { return usage.pin == gpio; }) == used_gpios_.end()) {
            gpios.push_back(gpio); // didn't find it in used_gpios_, so it's available
        }
    }
    return gpios;
}

// make a snapshot of the current GPIOs
void System::make_snapshot_gpios(std::vector<int8_t> & u_gpios, std::vector<int8_t> & s_gpios) {
    for (const auto & usage : used_gpios_) {
        u_gpios.push_back(usage.pin);
    }
    for (const auto & gpio : valid_system_gpios_) {
        s_gpios.push_back(gpio);
    }
}

// restore the GPIOs from the snapshot
void System::restore_snapshot_gpios(std::vector<int8_t> & u_gpios, std::vector<int8_t> & s_gpios) {
    used_gpios_.clear();
    for (const auto & gpio : u_gpios) {
        used_gpios_.push_back({static_cast<uint8_t>(gpio), "restored"});
    }

    valid_system_gpios_.clear();
    for (const auto & gpio : s_gpios) {
        valid_system_gpios_.push_back(gpio);
    }
}

// show the contents of a directory in the LittleFS filesystem
void System::listDir(const char * dirname, uint8_t levels) {
#if defined(EMSESP_DEBUG)
#ifndef EMSESP_STANDALONE

    File root = LittleFS.open(dirname);
    if (!root) {
        LOG_DEBUG("Failed to open directory %s", dirname);
        return;
    }
    if (!root.isDirectory()) {
        LOG_DEBUG("%s is not a directory", dirname);
        return;
    }

    LOG_DEBUG("(directory) %s", dirname);

    File file = root.openNextFile();
    while (file) {
        if (file.isDirectory()) {
            std::string line = std::string(file.name()) + "/";
            if (levels) {
                // prefix a / to the name to make it a full path
                listDir(("/" + String(file.name())).c_str(), levels - 1);
            }
        } else {
            std::string line = "  (file) " + std::string(file.name()) + " (" + std::to_string(file.size()) + " bytes)";
            LOG_DEBUG("%s", line.c_str());
        }
        file = root.openNextFile();
    }
#endif
#endif
}

} // namespace emsesp
